In [19]:
import pandas as pd
import numpy as np

In [3]:
DATA_PATH = "titanic.txt"

In [6]:
# Wczytanie danych
df = pd.read_csv(DATA_PATH)

# Zamiana "?" na NaN
df = df.replace("?", np.nan)

# Poprawa nazw kolumn
df.columns = [
    'pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
    'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'
]

# Zmiana na liczby
df['age'] = df['age'].astype(float)
df['fare'] = df['fare'].astype(float)

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [16]:
pd.DataFrame({
    'Kolumna' : ['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
    'Ilość etykiet' : [
        len(df.pclass.unique()), len(df.survived.unique()), len(df.name.unique()), len(df.sex.unique()),
        len(df.age.unique()), len(df.sibsp.unique()), len(df.parch.unique()), len(df.ticket.unique()),
        len(df.fare.unique()), len(df.cabin.unique()), len(df.embarked.unique()),
        len(df.boat.unique()), len(df.body.unique()), len(df['home.dest'].unique())],
    'Moc zbioru' : ['mała', 'mała', 'duża', 'mała', 'duża', 'mała', 'mała', 'duża', 'duża', 'duża', 'mała', 'średnia', 'duża', 'duża']
})

      Kolumna  Ilość etykiet Moc zbioru
0      pclass              3       mała
1    survived              2       mała
2        name           1307       duża
3         sex              2       mała
4         age             99       duża
5       sibsp              7       mała
6       parch              8       mała
7      ticket            929       duża
8        fare            282       duża
9       cabin            187       duża
10   embarked              4       mała
11       boat             28    średnio
12       body            122       duża
13  home.dest            370       duża

In [14]:
print(f'Liczba pasażerów to {len(df)}')

Liczba pasażerów to 1309

In [27]:
np.sort(np.array(df['cabin'].dropna().unique()))

array(['A10', 'A11', 'A14', 'A16', 'A18', 'A19', 'A20', 'A21', 'A23',
       'A24', 'A26', 'A29', 'A31', 'A32', 'A34', 'A36', 'A5', 'A6', 'A7',
       'A9', 'B10', 'B101', 'B102', 'B11', 'B18', 'B19', 'B20', 'B22',
       'B24', 'B26', 'B28', 'B3', 'B30', 'B35', 'B36', 'B37', 'B38',
       'B39', 'B4', 'B41', 'B42', 'B45', 'B49', 'B5', 'B50',
       'B51 B53 B55', 'B52 B54 B56', 'B57 B59 B63 B66', 'B58 B60', 'B61',
       'B69', 'B71', 'B73', 'B77', 'B78', 'B79', 'B80', 'B82 B84', 'B86',
       'B94', 'B96 B98', 'C101', 'C103', 'C104', 'C105', 'C106', 'C110',
       'C111', 'C116', 'C118', 'C123', 'C124', 'C125', 'C126', 'C128',
       'C130', 'C132', 'C148', 'C2', 'C22 C26', 'C23 C25 C27', 'C28',
       'C30', 'C31', 'C32', 'C39', 'C45', 'C46', 'C47', 'C49', 'C50',
       'C51', 'C52', 'C53', 'C54', 'C55 C57', 'C6', 'C62 C64', 'C65',
       'C68', 'C7', 'C70', 'C78', 'C80', 'C82', 'C83', 'C85', 'C86',
       'C87', 'C89', 'C90', 'C91', 'C92', 'C93', 'C95', 'C97', 'C99', 'D',
       'D10 D12', 'D11', 'D15', 'D17', 'D19', 'D20', 'D21', 'D22', 'D26',
       'D28', 'D30', 'D33', 'D34', 'D35', 'D36', 'D37', 'D38', 'D40',
       'D43', 'D45', 'D46', 'D47', 'D48', 'D49', 'D50', 'D56', 'D6', 'D7',
       'D9', 'E10', 'E101', 'E12', 'E121', 'E17', 'E24', 'E25', 'E31',
       'E33', 'E34', 'E36', 'E38', 'E39 E41', 'E40', 'E44', 'E45', 'E46',
       'E49', 'E50', 'E52', 'E58', 'E60', 'E63', 'E67', 'E68', 'E77',
       'E8', 'F', 'F E46', 'F E57', 'F E69', 'F G63', 'F G73', 'F2',
       'F33', 'F38', 'F4', 'G6', 'T'], dtype=object)

In [34]:
df['CabinReduced'] = df['cabin'].str.replace(r"\d+", "", regex=True)
np.sort(df['CabinReduced'].dropna().unique())

array(['A', 'B', 'B B', 'B B B', 'B B B B', 'C', 'C C', 'C C C', 'D',
       'D D', 'E', 'E E', 'F', 'F E', 'F G', 'G', 'T'], dtype=object)

In [53]:
pd.DataFrame({
    'Kolumna' : ['Cabin', 'CabinReduced'],
    'Count' : [len(df['CabinReduced'].dropna().unique()), len(df['cabin'].dropna().unique()) ]
})

        Kolumna  Count
0         Cabin     17
1  CabinReduced    186

In [52]:
len_new = len(df['CabinReduced'].dropna().unique())
len_old = len(df['cabin'].dropna().unique())
100*(len_old-len_new)/len_old

90.86021505376344

Zmniejszyłem kardynalność o 90%

In [55]:
df['home.dest.reduced'] = df['home.dest'].str.replace(r'^.*?,\s*', '', regex=True)
df['home.dest.reduced'] = df['home.dest.reduced'].str.replace(r'/.*?,\s*', '', regex=True)
df['home.dest.reduced'].unique()

array(['MO', 'PQ ON', 'NY', 'NI', 'Queens, NY', 'Uruguay', 'France', nan,
       'Yorks', 'PQ', 'MN', 'CA', 'MI', 'Sweden DC', 'NJ', 'OH',
       'England Cleveland, Ohio', 'MB', 'England Ohio', 'WA', 'NE', 'PA',
       'CO', 'MA', 'DC', 'Philadelphia, PA', 'Berkshire NY', 'Staffs',
       'ND', 'NY NY', 'England', 'England / Belfast', 'BC', 'IN', 'WI',
       'Peru', 'AB', 'MN IA', 'London / Paris', 'Essex', 'Switzerland',
       'Lancashire', 'France NY', 'CT', 'Surrey', 'London / Middlesex',
       'London / Birmingham', 'IL', 'NY /  Stamford CT',
       'France New York, NY', 'Liverpool', 'VT', 'London', 'OR', 'Sweden',
       'RI', 'Cuba', 'Belfast', 'Spain', 'ON', 'Netherlands', 'PA NY',
       'NY / Greenwich CT', 'Long Island, NY', 'WV', 'London Hants',
       'Ohio / ? Paris / New York', 'Mexico', 'Utah', 'ME',
       'NY / Briarcliff Manor NY', 'Switzerland PA', 'NS', 'NY DC',
       'PA, USA', 'Argentina NJ', 'England Houghton, MI', 'Cornwall OH',
       'Guernsey', 'Avon FL', 'Dorset MI', 'FL', 'India MI',
       'Cornwall MI', 'NY NJ', 'Chavez County, NM', 'South Africa WA',
       'Sweden IL', 'England CA', 'Hants', 'Thailand IL',
       'Huntingdonshire', 'Finland Ashtabula, Ohio', 'Hants ID',
       'Pennsylvania', 'UT', 'India Pittsburgh, PA', 'Brazil',
       'Italy / California', 'Southampton', 'Spain Cuba',
       'Norway Bayonne, NJ', 'India / Pennsylvania', 'Cornwall', 'WA OH',
       'Surrey / Chicago', 'Essex MB', 'SD', 'London MB', 'Finland MI',
       'Japan', 'Paris / Haiti', 'Switzerland IA', 'Somerset', 'Paris',
       'SK', 'Australia', 'Middlesex', 'Denmark', 'NJ andOhio', 'KY',
       'Glasgow', 'Germany', 'Kent NY', 'England NJ', 'England MT',
       'Devon', 'Russia', 'NH', 'Devon MI', 'Sussex',
       'England Ohio and Milwaukee, WI', 'DE', 'MT', 'Kent MI',
       'England / Massachusetts', 'Co Washington, VT', 'England CT',
       'England PQ', 'England RI', 'England OR', 'Finland Hoboken, NJ',
       'Sweden Brooklyn, NY', 'England Norfolk, VA', 'VA',
       'Finland Astoria, OR', 'Argentina',
       'Middlesex or Erdington, Birmingham', 'England New York, NY',
       'Norway', 'Finland New York, NY', 'Sweden Ministee, MI',
       'Sweden Minneapolis, MN', 'Sweden Bloomington, IL',
       'Sweden Moune, IL', 'Finland New York', 'Syria', 'Norway New York',
       'Sweden New York', 'Cardiff, Wales',
       'Co Cork, Ireland Glens Falls, NY', 'Sweden Chicago, IL',
       'Chelmsford, England', 'Ireland Roxbury, MA',
       'Co Cork, Ireland New York, NY', 'Ireland Charlestown, MA',
       'Ireland New York, NY', 'Croatia', 'Sweden Fower, MN',
       'Sweden Huntley, IL', 'Ireland Hartford, CT', 'Southampton, Hants',
       'Greece', 'Portugal', 'Ireland Sherbrooke, PQ', 'Ireland',
       'Austria', 'England Cleveland, OH', 'England Newark, NJ',
       'Austria-Hungary', 'IA', 'England Pontiac, MI',
       'England Bedford, OH', 'England Wichita, KS',
       'Co Sligo, Ireland New York, NY', 'Sweden Joliet, IL',
       'Sweden Jerome Junction, AZ', 'USA',
       'Co Longford, Ireland New York, NY',
       'Sussex, England Essex Co, MA', 'Somerset, England',
       'Ireland Washington, DC', 'Kent, England Detroit, MI',
       'England Niagara Falls, NY', 'Surrey, England',
       'Norway Portland, ND', 'Chicago, IL', 'Sweden New York, NY',
       'Norway Cameron, WI', 'Belgium OH'], dtype=object)

Dokonuję redukcji zmiennej cabin, bo istotne dla nas jest wysokość pokładu, a nie dokładny numer, bo będzie zbyt dużo danych, a modelowanie może nie wychwycić zależności.